luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDma_bf.h
/** \brief  Mask for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_OFF (24u)

/** \brief  Length for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_OFF (17u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_OFF (26u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_LEN (7u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_MSK (0x7fu)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_OFF (24u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_OFF (25u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_OFF (20u)

/** \brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_OFF (21u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_LEN (4u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_MSK (0xfu)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_OFF (12u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.CBLS */
#define IFX_DMA_BLK_ME_ADICR_CBLS_LEN (4u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.CBLS */
#define IFX_DMA_BLK_ME_ADICR_CBLS_MSK (0xfu)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.CBLS */
#define IFX_DMA_BLK_ME_ADICR_CBLS_OFF (8u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.DCBE */
#define IFX_DMA_BLK_ME_ADICR_DCBE_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.DCBE */
#define IFX_DMA_BLK_ME_ADICR_DCBE_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.DCBE */
#define IFX_DMA_BLK_ME_ADICR_DCBE_OFF (21u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.DMF */
#define IFX_DMA_BLK_ME_ADICR_DMF_LEN (3u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.DMF */
#define IFX_DMA_BLK_ME_ADICR_DMF_MSK (0x7u)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.DMF */
#define IFX_DMA_BLK_ME_ADICR_DMF_OFF (4u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.ETRL */
#define IFX_DMA_BLK_ME_ADICR_ETRL_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.ETRL */
#define IFX_DMA_BLK_ME_ADICR_ETRL_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.ETRL */
#define IFX_DMA_BLK_ME_ADICR_ETRL_OFF (23u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.INCD */
#define IFX_DMA_BLK_ME_ADICR_INCD_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.INCD */
#define IFX_DMA_BLK_ME_ADICR_INCD_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.INCD */
#define IFX_DMA_BLK_ME_ADICR_INCD_OFF (7u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.INCS */
#define IFX_DMA_BLK_ME_ADICR_INCS_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.INCS */
#define IFX_DMA_BLK_ME_ADICR_INCS_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.INCS */
#define IFX_DMA_BLK_ME_ADICR_INCS_OFF (3u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.INTCT */
#define IFX_DMA_BLK_ME_ADICR_INTCT_LEN (2u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.INTCT */
#define IFX_DMA_BLK_ME_ADICR_INTCT_MSK (0x3u)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.INTCT */
#define IFX_DMA_BLK_ME_ADICR_INTCT_OFF (26u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.IRDV */
#define IFX_DMA_BLK_ME_ADICR_IRDV_LEN (4u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.IRDV */
#define IFX_DMA_BLK_ME_ADICR_IRDV_MSK (0xfu)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.IRDV */
#define IFX_DMA_BLK_ME_ADICR_IRDV_OFF (28u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.SCBE */
#define IFX_DMA_BLK_ME_ADICR_SCBE_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.SCBE */
#define IFX_DMA_BLK_ME_ADICR_SCBE_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.SCBE */
#define IFX_DMA_BLK_ME_ADICR_SCBE_OFF (20u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.SHCT */
#define IFX_DMA_BLK_ME_ADICR_SHCT_LEN (4u)

/** \brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.SHCT */
#define IFX_DMA_BLK_ME_ADICR_SHCT_MSK (0xfu)

/** \brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.SHCT */
#define IFX_DMA_BLK_ME_ADICR_SHCT_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.SMF */
#define IFX_DMA_BLK_ME_ADICR_SMF_LEN (3u)

