luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDma_bf.h
/** \brief  Length for Ifx_DMA_BLK_ME_R5_Bits.RD51 */
#define IFX_DMA_BLK_ME_R5_RD51_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R5_Bits.RD51 */
#define IFX_DMA_BLK_ME_R5_RD51_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R5_Bits.RD51 */
#define IFX_DMA_BLK_ME_R5_RD51_OFF (8u)

/** \brief  Length for Ifx_DMA_BLK_ME_R5_Bits.RD52 */
#define IFX_DMA_BLK_ME_R5_RD52_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R5_Bits.RD52 */
#define IFX_DMA_BLK_ME_R5_RD52_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R5_Bits.RD52 */
#define IFX_DMA_BLK_ME_R5_RD52_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_ME_R5_Bits.RD53 */
#define IFX_DMA_BLK_ME_R5_RD53_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R5_Bits.RD53 */
#define IFX_DMA_BLK_ME_R5_RD53_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R5_Bits.RD53 */
#define IFX_DMA_BLK_ME_R5_RD53_OFF (24u)

/** \brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD60 */
#define IFX_DMA_BLK_ME_R6_RD60_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD60 */
#define IFX_DMA_BLK_ME_R6_RD60_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD60 */
#define IFX_DMA_BLK_ME_R6_RD60_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD61 */
#define IFX_DMA_BLK_ME_R6_RD61_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD61 */
#define IFX_DMA_BLK_ME_R6_RD61_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD61 */
#define IFX_DMA_BLK_ME_R6_RD61_OFF (8u)

/** \brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD62 */
#define IFX_DMA_BLK_ME_R6_RD62_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD62 */
#define IFX_DMA_BLK_ME_R6_RD62_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD62 */
#define IFX_DMA_BLK_ME_R6_RD62_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_ME_R6_Bits.RD63 */
#define IFX_DMA_BLK_ME_R6_RD63_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R6_Bits.RD63 */
#define IFX_DMA_BLK_ME_R6_RD63_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R6_Bits.RD63 */
#define IFX_DMA_BLK_ME_R6_RD63_OFF (24u)

/** \brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD70 */
#define IFX_DMA_BLK_ME_R7_RD70_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD70 */
#define IFX_DMA_BLK_ME_R7_RD70_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD70 */
#define IFX_DMA_BLK_ME_R7_RD70_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD71 */
#define IFX_DMA_BLK_ME_R7_RD71_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD71 */
#define IFX_DMA_BLK_ME_R7_RD71_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD71 */
#define IFX_DMA_BLK_ME_R7_RD71_OFF (8u)

/** \brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD72 */
#define IFX_DMA_BLK_ME_R7_RD72_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD72 */
#define IFX_DMA_BLK_ME_R7_RD72_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD72 */
#define IFX_DMA_BLK_ME_R7_RD72_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_ME_R7_Bits.RD73 */
#define IFX_DMA_BLK_ME_R7_RD73_LEN (8u)

/** \brief  Mask for Ifx_DMA_BLK_ME_R7_Bits.RD73 */
#define IFX_DMA_BLK_ME_R7_RD73_MSK (0xffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_R7_Bits.RD73 */
#define IFX_DMA_BLK_ME_R7_RD73_OFF (24u)

/** \brief  Length for Ifx_DMA_BLK_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_BLK_ME_RDCRC_RDCRC_LEN (32u)

/** \brief  Mask for Ifx_DMA_BLK_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_BLK_ME_RDCRC_RDCRC_MSK (0xffffffffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_RDCRC_Bits.RDCRC */
#define IFX_DMA_BLK_ME_RDCRC_RDCRC_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ME_SADR_Bits.SADR */
#define IFX_DMA_BLK_ME_SADR_SADR_LEN (32u)

/** \brief  Mask for Ifx_DMA_BLK_ME_SADR_Bits.SADR */
#define IFX_DMA_BLK_ME_SADR_SADR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_SADR_Bits.SADR */
#define IFX_DMA_BLK_ME_SADR_SADR_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_BLK_ME_SDCRC_SDCRC_LEN (32u)

/** \brief  Mask for Ifx_DMA_BLK_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_BLK_ME_SDCRC_SDCRC_MSK (0xffffffffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_SDCRC_Bits.SDCRC */
#define IFX_DMA_BLK_ME_SDCRC_SDCRC_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ME_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_ME_SHADR_SHADR_LEN (32u)

/** \brief  Mask for Ifx_DMA_BLK_ME_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_ME_SHADR_SHADR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_DMA_BLK_ME_SHADR_Bits.SHADR */
#define IFX_DMA_BLK_ME_SHADR_SHADR_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_LEN (7u)

/** \brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_MSK (0x7fu)

/** \brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.CH */
#define IFX_DMA_BLK_ME_SR_CH_OFF (16u)

/** \brief  Length for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.RS */
#define IFX_DMA_BLK_ME_SR_RS_OFF (0u)

/** \brief  Length for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_LEN (1u)

/** \brief  Mask for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_BLK_ME_SR_Bits.WS */
#define IFX_DMA_BLK_ME_SR_WS_OFF (4u)

/** \brief  Length for Ifx_DMA_CH_ADICR_Bits.CBLD */
#define IFX_DMA_CH_ADICR_CBLD_LEN (4u)

/** \brief  Mask for Ifx_DMA_CH_ADICR_Bits.CBLD */
#define IFX_DMA_CH_ADICR_CBLD_MSK (0xfu)

/** \brief  Offset for Ifx_DMA_CH_ADICR_Bits.CBLD */
#define IFX_DMA_CH_ADICR_CBLD_OFF (12u)

/** \brief  Length for Ifx_DMA_CH_ADICR_Bits.CBLS */
#define IFX_DMA_CH_ADICR_CBLS_LEN (4u)

/** \brief  Mask for Ifx_DMA_CH_ADICR_Bits.CBLS */
#define IFX_DMA_CH_ADICR_CBLS_MSK (0xfu)

/** \brief  Offset for Ifx_DMA_CH_ADICR_Bits.CBLS */
#define IFX_DMA_CH_ADICR_CBLS_OFF (8u)

/** \brief  Length for Ifx_DMA_CH_ADICR_Bits.DCBE */
#define IFX_DMA_CH_ADICR_DCBE_LEN (1u)

/** \brief  Mask for Ifx_DMA_CH_ADICR_Bits.DCBE */
#define IFX_DMA_CH_ADICR_DCBE_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_CH_ADICR_Bits.DCBE */
#define IFX_DMA_CH_ADICR_DCBE_OFF (21u)

/** \brief  Length for Ifx_DMA_CH_ADICR_Bits.DMF */
#define IFX_DMA_CH_ADICR_DMF_LEN (3u)

/** \brief  Mask for Ifx_DMA_CH_ADICR_Bits.DMF */
#define IFX_DMA_CH_ADICR_DMF_MSK (0x7u)

/** \brief  Offset for Ifx_DMA_CH_ADICR_Bits.DMF */
#define IFX_DMA_CH_ADICR_DMF_OFF (4u)

/** \brief  Length for Ifx_DMA_CH_ADICR_Bits.ETRL */
#define IFX_DMA_CH_ADICR_ETRL_LEN (1u)

/** \brief  Mask for Ifx_DMA_CH_ADICR_Bits.ETRL */
#define IFX_DMA_CH_ADICR_ETRL_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_CH_ADICR_Bits.ETRL */
#define IFX_DMA_CH_ADICR_ETRL_OFF (23u)

/** \brief  Length for Ifx_DMA_CH_ADICR_Bits.INCD */
#define IFX_DMA_CH_ADICR_INCD_LEN (1u)

/** \brief  Mask for Ifx_DMA_CH_ADICR_Bits.INCD */
#define IFX_DMA_CH_ADICR_INCD_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_CH_ADICR_Bits.INCD */
#define IFX_DMA_CH_ADICR_INCD_OFF (7u)

/** \brief  Length for Ifx_DMA_CH_ADICR_Bits.INCS */
#define IFX_DMA_CH_ADICR_INCS_LEN (1u)

/** \brief  Mask for Ifx_DMA_CH_ADICR_Bits.INCS */
#define IFX_DMA_CH_ADICR_INCS_MSK (0x1u)

/** \brief  Offset for Ifx_DMA_CH_ADICR_Bits.INCS */
#define IFX_DMA_CH_ADICR_INCS_OFF (3u)

